In [42]:
import pandas as pd
import seaborn as sns

In [2]:
url1 = 'https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/order_leads.csv'
url2 = 'https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/sales_team.csv'

In [4]:
order_leads=pd.read_csv(url1,parse_dates=[3])
sales_team=pd.read_csv(url2)

In [9]:
order_leads.shape

(100000, 6)

In [8]:
order_leads.columns

Index(['Order Id', 'Company Id', 'Company Name', 'Date', 'Order Value',
       'Converted'],
      dtype='object')

In [11]:
order_leads.head()

,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,HZSXLI1IS9RGABZW,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-10-13,6952,0
1,582WPS3OW8T6YT0R,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-09-02,7930,0
2,KRF65MQZBOYG4Y9T,D0AUXPP07H6AVSGD,Melancholy Social-Role,2016-12-21,5538,1
3,N3EDZ5V1WGSWW828,D0AUXPP07H6AVSGD,Melancholy Social-Role,2018-06-03,1113,0
4,QXBC8COXEXGFSPLP,D0AUXPP07H6AVSGD,Melancholy Social-Role,2014-07-26,4596,0

In [13]:
order_leads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Order Id      100000 non-null  object
 1   Company Id    100000 non-null  object
 2   Company Name  100000 non-null  object
 3   Date          100000 non-null  datetime64[ns]
 4   Order Value   100000 non-null  int64
 5   Converted     100000 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.6+ MB

In [18]:
order_leads.drop('Company Id',inplace=True ,axis=1)

In [19]:
order_leads

,Order Id,Company Name,Date,Order Value,Converted
0,HZSXLI1IS9RGABZW,Melancholy Social-Role,2017-10-13,6952,0
1,582WPS3OW8T6YT0R,Melancholy Social-Role,2017-09-02,7930,0
2,KRF65MQZBOYG4Y9T,Melancholy Social-Role,2016-12-21,5538,1
3,N3EDZ5V1WGSWW828,Melancholy Social-Role,2018-06-03,1113,0
4,QXBC8COXEXGFSPLP,Melancholy Social-Role,2014-07-26,4596,0
...,...,...,...,...,...
99995,HKZFX556ZQRZJZWR,Trade-Preparatory Quarterbacks,2017-11-06,7516,0
99996,962CSDMAJ49E0CRK,Trade-Preparatory Quarterbacks,2018-08-02,442,1
99997,ZW7RO9TLL6EVVJEC,Trade-Preparatory Quarterbacks,2014-11-02,8544,0
99998,LNKGIWMZ9RT49IE9,Trade-Preparatory Quarterbacks,2017-04-01,6650,0
99999,X9Y21H4JWX6OGC2Z,Trade-Preparatory Quarterbacks,2016-07-27,953,0

In [20]:
order_leads.head()

           Order Id            Company Name       Date  Order Value  Converted
0  HZSXLI1IS9RGABZW  Melancholy Social-Role 2017-10-13         6952          0
1  582WPS3OW8T6YT0R  Melancholy Social-Role 2017-09-02         7930          0
2  KRF65MQZBOYG4Y9T  Melancholy Social-Role 2016-12-21         5538          1
3  N3EDZ5V1WGSWW828  Melancholy Social-Role 2018-06-03         1113          0
4  QXBC8COXEXGFSPLP  Melancholy Social-Role 2014-07-26         4596          0

In [22]:
order_leads.duplicated().sum()

0

In [23]:
order_leads.isna().sum()

Order Id        0
Company Name    0
Date            0
Order Value     0
Converted       0
dtype: int64

In [24]:
order_leads.isnull().sum()

Order Id        0
Company Name    0
Date            0
Order Value     0
Converted       0
dtype: int64

In [26]:
sales_team.shape

(4619, 4)

In [28]:
sales_team.columns

Index(['Sales Rep', 'Sales Rep Id', 'Company Name', 'Company Id'], dtype='object')

In [31]:
sales_team.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4619 entries, 0 to 4618
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sales Rep     4619 non-null   object
 1   Sales Rep Id  4619 non-null   object
 2   Company Name  4619 non-null   object
 3   Company Id    4619 non-null   object
dtypes: object(4)
memory usage: 144.5+ KB

In [32]:
sales_team.drop('Company Id',axis=1,inplace=True)

In [33]:
sales_team

           Sales Rep      Sales Rep Id                    Company Name
0     William Taylor  ZTZA0ZLYZR85PTUJ          Melancholy Social-Role
1     William Taylor  ZTZA0ZLYZR85PTUJ                  Pee-Wee Pigeon
2     William Taylor  ZTZA0ZLYZR85PTUJ             Vaginal 36-Year-Old
3     William Taylor  ZTZA0ZLYZR85PTUJ            Unhurried Musician'S
4     William Taylor  ZTZA0ZLYZR85PTUJ             Comprehensive Lists
...              ...               ...                             ...
4614    Ida Woodward  LF3CPWWZKSNB1AXI          Unauthorized Increases
4615    Ida Woodward  LF3CPWWZKSNB1AXI             Atom-Like Principle
4616    Ida Woodward  LF3CPWWZKSNB1AXI        Congratulatory Economist
4617    Ida Woodward  LF3CPWWZKSNB1AXI                 Readable Pilots
4618    Ida Woodward  LF3CPWWZKSNB1AXI  Trade-Preparatory Quarterbacks

[4619 rows x 3 columns]

In [34]:
sales_team.duplicated().sum()

0

In [35]:
sales_team.isna().sum()

Sales Rep       0
Sales Rep Id    0
Company Name    0
dtype: int64

In [40]:
df=pd.merge(order_leads,sales_team,on='Company Name')
df.head()

,Order Id,Company Name,Date,Order Value,Converted,Sales Rep,Sales Rep Id
0,HZSXLI1IS9RGABZW,Melancholy Social-Role,2017-10-13,6952,0,William Taylor,ZTZA0ZLYZR85PTUJ
1,582WPS3OW8T6YT0R,Melancholy Social-Role,2017-09-02,7930,0,William Taylor,ZTZA0ZLYZR85PTUJ
2,KRF65MQZBOYG4Y9T,Melancholy Social-Role,2016-12-21,5538,1,William Taylor,ZTZA0ZLYZR85PTUJ
3,N3EDZ5V1WGSWW828,Melancholy Social-Role,2018-06-03,1113,0,William Taylor,ZTZA0ZLYZR85PTUJ
4,QXBC8COXEXGFSPLP,Melancholy Social-Role,2014-07-26,4596,0,William Taylor,ZTZA0ZLYZR85PTUJ

In [38]:
df.shape

(100000, 7)

In [39]:
df.columns

Index(['Order Id', 'Company Name', 'Date', 'Order Value', 'Converted',
       'Sales Rep', 'Sales Rep Id'],
      dtype='object')

In [41]:
df.isna().sum()

Order Id        0
Company Name    0
Date            0
Order Value     0
Converted       0
Sales Rep       0
Sales Rep Id    0
dtype: int64

In [ ]:
sns.axes_style(style=Order Value,)